root-2.3.0/run/MicroChannelFOAM/MicroChannel2/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0e-5;

vertices
(
    (0 0 0)
    (10 0 0)
    (100 0 0)
    (0 2.5 0)
    (10 4.5 0)
    (100 4.5 0)
    (10 5.5 0)
    (100 5.5 0)
    (0 7.5 0)
    (0 10 0)
    (10 10 0)
    (100 10 0)
    (0 0 0.1)
    (10 0 0.1)
    (100 0 0.1)
    (0 2.5 0.1)
    (10 4.5 0.1)
    (100 4.5 0.1)
    (10 5.5 0.1)
    (100 5.5 0.1)
    (0 7.5 0.1)
    (0 10 0.1)
    (10 10 0.1)
    (100 10 0.1)
);

blocks
(
    hex (0 1 4 3 12 13 16 15) (5 5 1) simpleGrading (1 1 1)
    hex (1 2 5 4 13 14 17 16) (45 5 1) simpleGrading (1 1 1)
    hex (4 5 7 6 16 17 19 18) (45 5 1) simpleGrading (1 1 1)
    hex (8 6 10 9 20 18 22 21) (5 5 1) simpleGrading (1 1 1)
    hex (6 7 11 10 18 19 23 22) (45 5 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    AirInlet
    {
        type patch;
        faces
        (
            (4 16 18 6)
        );
    }
    WaterInlet
    {
        type patch;
        faces
        (
            (0 12 15 3)
            (8 20 21 9)
        );
    }
    ChannelWall
    {
        type wall;
        faces
        (
            (3 4 16 15)
            (8 6 18 20)
            (9 10 22 21)
            (10 11 23 22)
            (0 1 13 12)
            (1 2 14 13)
        );
    }
    Outlet
    {
        type patch;
        faces
        (
            (2 14 17 5)
            (5 17 19 7)
            (7 19 23 11)
        );
    }
    FrontAndBack
    {
        type empty;
        faces
        (
            (0 1 4 3)
            (1 2 5 4)
            (4 5 7 6)
            (8 6 10 9)
            (6 7 11 10)
            (12 13 16 15)
            (13 14 17 16)
            (16 17 19 18)
            (20 18 22 21)
            (18 19 23 22)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
